Revit 2027 API
RevisionCloud.GetSketchCurves Method
 Returns copies of the Curves that form this RevisionCloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetSketchCurves()
Public Function GetSketchCurves As IList(Of Curve)
public:
IList<Curve^>^ GetSketchCurves()
member GetSketchCurves : unit -> IList<Curve>
Return Value
IList<Curve>
 Copies of the sketched curves that form this RevisionCloud.
Remarks
 Note that there is no requirement that the curves form closed loops or avoid self-intersections. The curves may also form multiple closed loops.
See Also
Reference
RevisionCloud Class
Autodesk.Revit.DB Namespace